[
  "What are the trending DeFi projects on Solana today?",
  "Which Solana tokens have the highest trading volume right now?",
  "Can you recommend low-risk tokens on Solana?",
  "How do I provide liquidity on Solana-based DEXes?",
  "What's the safest way to stake my SOL?",
  "Which Solana tokens are considered undervalued?",
  "Can you identify promising new Solana-based tokens?",
  "What are the top NFT collections on Solana currently?",
  "How can I reduce risk in my crypto portfolio?",
  "What token on Solana has shown the most growth this month?",
  "What are the best Solana wallets for DeFi users?",
  "How can I track impermanent loss on Solana DEXes?",
  "Are there yield farms on Solana with low risk?",
  "What's the risk profile of SOL compared to ETH?",
  "How diversified is my portfolio across different token sectors?",
  "Which Solana tokens offer the best staking rewards?",
  "What are the main risks in Solana DeFi?",
  "Can I earn passive income with stablecoins on Solana?",
  "Which tokens in my portfolio are most volatile?",
  "How has my portfolio value changed over the last 30 days?",
  "Can you break down the risk level for each of my tokens?",
  "What percent of my portfolio is exposed to meme coins?",
  "Are there any high-yield, low-risk opportunities on Solana?",
  "Which tokens should I sell to rebalance my portfolio?",
  "What are the recent major hacks or rug pulls on Solana?",
  "Which lending protocols on Solana are considered safe?",
  "How do Solana liquid staking tokens compare?",
  "Which of my tokens are trending on Solana social media?",
  "Can you simulate the performance of my portfolio in a bear market?",
  "Are there any governance tokens on Solana worth holding?",
  "How can I hedge against downside in my Solana portfolio?",
  "What are the differences between Marinade and Jito for staking SOL?",
  "Which projects on Solana are backed by strong teams or VCs?",
  "What are the risks of holding LP tokens on Solana?",
  "How exposed is my portfolio to Solana-native risks?",
  "Which tokens are underperforming in my portfolio?",
  "How does my portfolio compare to a typical Solana index?",
  "What would happen to my portfolio if SOL drops 50%?",
  "Can you identify any rug-pull warnings in my current holdings?",
  "What are the best performing tokens on Solana YTD?",
  "Which of my assets have smart contract audit issues?",
  "What's the total yield I'm earning from my staked tokens?",
  "Should I rebalance into more stable assets?",
  "How can I track on-chain performance of a specific Solana token?",
  "What's the historical ROI of the top Solana tokens?",
  "Can you show my portfolio allocation by sector (DeFi, NFT, GameFi)?",
  "Are there any Solana launchpads I should follow for new tokens?",
  "How do I avoid scams and pump-and-dumps on Solana?",
  "What's my risk exposure if Solana network slows down or fails?",
  "Which tokens in my portfolio are most correlated with SOL?"
]
